apache/nuttx/arch/arm/src/sam34/hardware/sam4e_pio.h
#define SAM_PIOE_PER               (SAM_PIOE_BASE+SAM_PIO_PER_OFFSET)
#define SAM_PIOE_PDR               (SAM_PIOE_BASE+SAM_PIO_PDR_OFFSET)
#define SAM_PIOE_PSR               (SAM_PIOE_BASE+SAM_PIO_PSR_OFFSET)
#define SAM_PIOE_OER               (SAM_PIOE_BASE+SAM_PIO_OER_OFFSET)
#define SAM_PIOE_ODR               (SAM_PIOE_BASE+SAM_PIO_ODR_OFFSET)
#define SAM_PIOE_OSR               (SAM_PIOE_BASE+SAM_PIO_OSR_OFFSET)
#define SAM_PIOE_IFER              (SAM_PIOE_BASE+SAM_PIO_IFER_OFFSET)
#define SAM_PIOE_IFDR              (SAM_PIOE_BASE+SAM_PIO_IFDR_OFFSET)
#define SAM_PIOE_IFSR              (SAM_PIOE_BASE+SAM_PIO_IFSR_OFFSET)
#define SAM_PIOE_SODR              (SAM_PIOE_BASE+SAM_PIO_SODR_OFFSET)
#define SAM_PIOE_CODR              (SAM_PIOE_BASE+SAM_PIO_CODR_OFFSET)
#define SAM_PIOE_ODSR              (SAM_PIOE_BASE+SAM_PIO_ODSR_OFFSET)
#define SAM_PIOE_PDSR              (SAM_PIOE_BASE+SAM_PIO_PDSR_OFFSET)
#define SAM_PIOE_IER               (SAM_PIOE_BASE+SAM_PIO_IER_OFFSET)
#define SAM_PIOE_IDR               (SAM_PIOE_BASE+SAM_PIO_IDR_OFFSET)
#define SAM_PIOE_IMR               (SAM_PIOE_BASE+SAM_PIO_IMR_OFFSET)
#define SAM_PIOE_ISR               (SAM_PIOE_BASE+SAM_PIO_ISR_OFFSET)
#define SAM_PIOE_MDER              (SAM_PIOE_BASE+SAM_PIO_MDER_OFFSET)
#define SAM_PIOE_MDDR              (SAM_PIOE_BASE+SAM_PIO_MDDR_OFFSET)
#define SAM_PIOE_MDSR              (SAM_PIOE_BASE+SAM_PIO_MDSR_OFFSET)
#define SAM_PIOE_PUDR              (SAM_PIOE_BASE+SAM_PIO_PUDR_OFFSET)
#define SAM_PIOE_PUER              (SAM_PIOE_BASE+SAM_PIO_PUER_OFFSET)
#define SAM_PIOE_PUSR              (SAM_PIOE_BASE+SAM_PIO_PUSR_OFFSET)
#define SAM_PIOE_ABCDSR1           (SAM_PIOE_BASE+SAM_PIO_ABCDSR1_OFFSET)
#define SAM_PIOE_ABCDSR2           (SAM_PIOE_BASE+SAM_PIO_ABCDSR2_OFFSET)
#define SAM_PIOE_IFSCDR            (SAM_PIOE_BASE+SAM_PIO_IFSCDR_OFFSET)
#define SAM_PIOE_IFSCER            (SAM_PIOE_BASE+SAM_PIO_IFSCER_OFFSET)
#define SAM_PIOE_IFSCSR            (SAM_PIOE_BASE+SAM_PIO_IFSCSR_OFFSET)
#define SAM_PIOE_SCDR              (SAM_PIOE_BASE+SAM_PIO_SCDR_OFFSET)
#define SAM_PIOE_PPDDR             (SAM_PIOE_BASE+SAM_PIO_PPDDR_OFFSET)
#define SAM_PIOE_PPDER             (SAM_PIOE_BASE+SAM_PIO_PPDER_OFFSET)
#define SAM_PIOE_PPDSR             (SAM_PIOE_BASE+SAM_PIO_PPDSR_OFFSET)
#define SAM_PIOE_OWER              (SAM_PIOE_BASE+SAM_PIO_OWER_OFFSET)
#define SAM_PIOE_OWDR              (SAM_PIOE_BASE+SAM_PIO_OWDR_OFFSET)
#define SAM_PIOE_OWSR              (SAM_PIOE_BASE+SAM_PIO_OWSR_OFFSET)
#define SAM_PIOE_AIMER             (SAM_PIOE_BASE+SAM_PIO_AIMER_OFFSET)
#define SAM_PIOE_AIMDR             (SAM_PIOE_BASE+SAM_PIO_AIMDR_OFFSET)
#define SAM_PIOE_AIMMR             (SAM_PIOE_BASE+SAM_PIO_AIMMR_OFFSET)
#define SAM_PIOE_ESR               (SAM_PIOE_BASE+SAM_PIO_ESR_OFFSET)
#define SAM_PIOE_LSR               (SAM_PIOE_BASE+SAM_PIO_LSR_OFFSET)
#define SAM_PIOE_ELSR              (SAM_PIOE_BASE+SAM_PIO_ELSR_OFFSET)
#define SAM_PIOE_FELLSR            (SAM_PIOE_BASE+SAM_PIO_FELLSR_OFFSET)
#define SAM_PIOE_REHLSR            (SAM_PIOE_BASE+SAM_PIO_REHLSR_OFFSET)
#define SAM_PIOE_FRLHSR            (SAM_PIOE_BASE+SAM_PIO_FRLHSR_OFFSET)
#define SAM_PIOE_LOCKSR            (SAM_PIOE_BASE+SAM_PIO_LOCKSR_OFFSET)
#define SAM_PIOE_WPMR              (SAM_PIOE_BASE+SAM_PIO_WPMR_OFFSET)
#define SAM_PIOE_WPSR              (SAM_PIOE_BASE+SAM_PIO_WPSR_OFFSET)
#define SAM_PIOE_SCHMITT           (SAM_PIOE_BASE+SAM_PIO_SCHMITT_OFFSET)
#define SAM_PIOE_DELAYR            (SAM_PIOE_BASE+SAM_PIO_DELAYR_OFFSET)
#define SAM_PIOE_PCMR              (SAM_PIOE_BASE+SAM_PIO_PCMR_OFFSET)
#define SAM_PIOE_PCIER             (SAM_PIOE_BASE+SAM_PIO_PCIER_OFFSET)
#define SAM_PIOE_PCIDR             (SAM_PIOE_BASE+SAM_PIO_PCIDR_OFFSET)
#define SAM_PIOE_PCIMR             (SAM_PIOE_BASE+SAM_PIO_PCIMR_OFFSET)
#define SAM_PIOE_PCISR             (SAM_PIOE_BASE+SAM_PIO_PCISR_OFFSET)
#define SAM_PIOE_PCRHR             (SAM_PIOE_BASE+SAM_PIO_PCRHR_OFFSET

/* PIO register bit definitions *********************************************************/

/* Common bit definitions for ALMOST all IO registers (exceptions follow) */

#define PIO(n)                     (1 << (n)) /* Bit n: PIO n, n=0-31 */

/* PIO Slow Clock Divider Debouncing Register */

#define PIO_SCDR_MASK              (0x3fff) /* Bits 0-13: Slow Clock Divider */

/* PIO Write Protect Mode Register */

#define PIO_WPMR_WPEN              (1 << 0)  /* Bit 0:  Write Protect Enable */
#define PIO_WPMR_WPKEY_SHIFT       (8)       /* Bits 8-31: Write Protect KEY */
#define PIO_WPMR_WPKEY_MASK        (0xffffff << PIO_WPMR_WPKEY_SHIFT)
#  define PIO_WPMR_WPKEY           (0x50494f << PIO_WPMR_WPKEY_SHIFT)

/* PIO Write Protect Status Register */

#define PIO_WPSR_WPVS              (1 << 0)  /* Bit 0:  Write Protect Violation Status */
#define PIO_WPSR_WPVSRC_SHIFT      (8)       /* Bits 8-23: Write Protect Violation Source */
#define PIO_WPSR_WPVSRC_MASK       (0xffff << PIO_WPSR_WPVSRC_SHIFT)

/* IO Delay Register */

#define PIO_DELAYR_DELAY_SHIFT(d)  ((d) << 2)
#define PIO_DELAYR_DELAY_MASK(d)   (15 << PIO_DELAYR_SHIFT(d))
#  define PIO_DELAYR_DELAY(d,n)    ((uint32_t)(n) << PIO_DELAYR_SHIFT(d))

#define PIO_DELAYR_DELAY0_SHIFT    (0)       /* Bits 0-3: Delay 0 */
#define PIO_DELAYR_DELAY0_MASK     (15 << PIO_DELAYR_DELAY0_SHIFT)
#  define PIO_DELAYR_DELAY0(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY0_SHIFT)
#define PIO_DELAYR_DELAY1_SHIFT    (4)       /* Bits 4-7: Delay 0 */
#define PIO_DELAYR_DELAY1_MASK     (15 << PIO_DELAYR_DELAY1_SHIFT)
#  define PIO_DELAYR_DELAY1(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY1_SHIFT)
#define PIO_DELAYR_DELAY2_SHIFT    (8)       /* Bits 8-11: Delay 0 */
#define PIO_DELAYR_DELAY2_MASK     (15 << PIO_DELAYR_DELAY2_SHIFT)
#  define PIO_DELAYR_DELAY2(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY2_SHIFT)
#define PIO_DELAYR_DELAY3_SHIFT    (12)      /* Bits 12-15: Delay 0 */
#define PIO_DELAYR_DELAY3_MASK     (15 << PIO_DELAYR_DELAY3_SHIFT)
#  define PIO_DELAYR_DELAY3(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY3_SHIFT)
#define PIO_DELAYR_DELAY4_SHIFT    (16)      /* Bits 16-19: Delay 0 */
#define PIO_DELAYR_DELAY4_MASK     (15 << PIO_DELAYR_DELAY4_SHIFT)
#  define PIO_DELAYR_DELAY4(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY4_SHIFT)
#define PIO_DELAYR_DELAY5_SHIFT    (20)      /* Bits 20-23: Delay 0 */
#define PIO_DELAYR_DELAY5_MASK     (15 << PIO_DELAYR_DELAY5_SHIFT)
#  define PIO_DELAYR_DELAY5(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY5_SHIFT)
#define PIO_DELAYR_DELAY6_SHIFT    (24)      /* Bits 24-27: Delay 0 */
#define PIO_DELAYR_DELAY6_MASK     (15 << PIO_DELAYR_DELAY6_SHIFT)
#  define PIO_DELAYR_DELAY6(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY6_SHIFT)
#define PIO_DELAYR_DELAY7_SHIFT    (28)      /* Bits 28-31: Delay 0 */
#define PIO_DELAYR_DELAY7_MASK     (15 << PIO_DELAYR_DELAY7_SHIFT)
#  define PIO_DELAYR_DELAY7(n)     ((uint32_t)(n) << PIO_DELAYR_DELAY7_SHIFT)

/* PIO Parallel Capture Mode Register */

#define PIO_PCMR_PCEN              (1 << 0)  /* Bit 0:  Parallel Capture Mode Enable */
#define PIO_PCMR_DSIZE_SHIFT       (4)       /* Bits 4-5: Parallel Capture Mode Data Size */
#define PIO_PCMR_DSIZE_MASK        (3 << PIO_PCMR_DSIZE_SHIFT)
#  define PIO_PCMR_DSIZE_BYTE      (0 << PIO_PCMR_DSIZE_SHIFT) /* 8-bit data in PIO_PCRHR */
#  define PIO_PCMR_DSIZE_HWORD     (1 << PIO_PCMR_DSIZE_SHIFT) /* 16-bit data in PIO_PCRHR */
#  define PIO_PCMR_DSIZE_WORD      (2 << PIO_PCMR_DSIZE_SHIFT) /* 32-bit data in PIO_PCRHR */
#define PIO_PCMR_ALWYS             (1 << 9)  /* Bit 9:  Parallel Capture Mode Always Sampling */
#define PIO_PCMR_HALFS             (1 << 10) /* Bit 10: Parallel Capture Mode Half Sampling */
#define PIO_PCMR_FRSTS             (1 << 11) /* Bit 11: Parallel Capture Mode First Sample */

/* PIO Parallel Capture Interrupt Enable, Disable, Mask, and Status Registers */

#define PIOC_PCINT_DRDY            (1 << 0)  /* Bit 0:  Parallel Capture Mode Data Ready Interrupt Enable */
#define PIOC_PCINT_OVRE            (1 << 1)  /* Bit 1:  Parallel Capture Mode Overrun Error Interrupt Enable */
#define PIOC_PCINT_ENDRX           (1 << 2)  /* Bit 2:  End of Reception Transfer Interrupt Enable */
#define PIOC_PCINT_RXBUFF          (1 << 3)  /* Bit 3:  Reception Buffer Full Interrupt Enable */

/****************************************************************************************
 * Public Types
 ****************************************************************************************/

/****************************************************************************************
 * Public Data
 ****************************************************************************************/

/****************************************************************************************
 * Public Functions
 ****************************************************************************************/

#endif /* __ARCH_ARM_SRC_SAM34_HARDWARE_SAM4E_PIO_H */
